TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/bsl/secondary_bsl_spi/secondary_bsl.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0L111X" --package "LQFP-48(PT)" --part "Default"
// @v2CliArgs --device "MSPM0L111X" --package "LQFP-48(PT)"
// @cliArgs --board /ti/boards/LP_MSPM0L1117 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const NONMAIN       = scripting.addModule("/ti/driverlib/NONMAIN");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
NONMAIN.nonmainWarning               = true;
NONMAIN.staticWriteProtectionNonMain = true;
NONMAIN.bslAltConfig                 = true;
NONMAIN.bslAltAddress                = 0x20C1;
NONMAIN.staticWriteProtectionMainLow = 0xFFFF00FF;

ProjectConfig.genLibs    = false;
ProjectConfig.genOpts    = false;
ProjectConfig.genLinker  = false;
ProjectConfig.genStartup = false;
